app/controllers/movies_controller.rb

SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 1]]
SELECT "movies".* FROM "movies" WHERE "movies"."director" = ?  [["director", "George Lucas"]]
SELECT COUNT(*) FROM "movies" WHERE "movies"."director" = ?  [["director", "George Lucas"]]
---
  def similar
    # Grab movie info
    @movie = Movie.find params[:id]

    # Grab all of the movies by the director of the movie
    # provided in params[:id]
    @movie_list = Movie.find_directors_movies(params[:id])

    # If the movie list is empty, just flash a message
    # and return
    if @movie_list.empty?